START_MESSAGE = 'Стартовое сообщение'
MAIN_MENU_MESSAGE = "СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 5"
PACKS_MESSAGE = ''
TEN_PACKS_MESSAGE = 'Показать ТОП-10'
WELCOME_PACKS_MESSAGE = 'Чтобы послушать пак ответьте на сообщение со списком цифрой номера нужного пака'

PACKS_GENRES_EMPTY = 'Паков пока нет'
DOWNLOAD_PACK = 'Понравился пак ?'
DOWNLOAD_PACK_MESSAGE = 'Чтобы скачать звук, ответь что угодно на сообщение с названием.\n' \
                        'Загружаем пак - '
BUY_PACK = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 1'
EXCLUSIVE_CONTENT_EMPTY = 'Экслюзивные паки отсутствуют'
FINISH_SOUNDS = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 7 (ПРО КОНЕЦ ЗВУКОВ)'
DELAY_MESSAGE_PACK = "Лови. Пак появится в Библиотеке звуков"

NEED_PAYMENT = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 13 ( нужна подписка для скачивания)'
PAYMENT_TITLE_MESSAGE = 'Подписка на -'
PAYMENT_PACK = 'Покупка пака - '
PAYMENT_PACK_SUCCESS= 'Спасибо за покупку пака 15'
PAYMENT_PACK_MESSAGE = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 14 (ОПИСАНИЕ пка я хз можно хранить)'
PAYMENT_BODY_MESSAGE = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 9 (описание подписки месяц)'
PAYMENT_BODY_MESSAGE_1 = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 10 (описание подписки 3 месяца)'
PAYMENT_BODY_MESSAGE_2 = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 11 (описание подписки год)'
PAYMENT_SUCCESFULL = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 12 (успешная оплата)'

PAYMENT_MESSAGE = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 10(ОПИСАНИЕ ПОДПИСОК)'


def DELAY_MESSAGE_SOUND(sound):
    return f"Звук {sound} добавлен в библиотеку"


SOUNDS_LIMIT = 'Выгружено 50 звуков'

SOUNDS_MESSAGE = "СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 6"
DOWNLOAD_LIB_MESSAGE = 'Скоро пришлем - '

DRUMS_MESSAGE = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 3'
MELODIES_MESSAGE = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 4'

SOUND_MESSAGE = 'Чтобы скачать звук, выбери сообщение с его названием и ответь на ' \
                'него любой буквой\nЗагружаю звуки...'
SOUND_MESSAGE_END = 'Фух. Вроде все'

SOUND_MESSAGE_EMPTY = 'Здесь пусто...но это пока'

NOT_SUB = 'Для скачивания звуков в высоком качестве — подпишитесь на бот Библиотека звуков.\n' \
          'В него добавляются все скачанные файлы - это твоя библиотека паков/звуков'

ACCOUNT_MESSAGE = 'Здесь все про тебя'
REF_MESSAGE = 'Твоя рефферальная ссылка'

GENRES_MESSAGE = 'СООБЩЕНИЕ КОТОРОЕ НУЖНО ЗАПОЛНИТЬ 2'

PACKS_BY_JANRES = 'Паки по твоему фильтру'

UPDATE_MESSAGE = 'База звуков обновилась'
